qwert-asgardian/PIC16f887-projects/7.TIMERS/TIMER1_SIGNALS.X/TIMER1_SIGNAL.c
#pragma config FOSC = INTRC_NOCLKOUT// Oscillator Selection bits (INTOSCIO oscillator: I/O function on RA6/OSC2/CLKOUT pin, I/O function on RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = ON       // Power-up Timer Enable bit (PWRT enabled)
#pragma config MCLRE = ON       // RE3/MCLR pin function select bit (RE3/MCLR pin function is MCLR)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = OFF      // Brown Out Reset Selection bits (BOR disabled)
#pragma config IESO = ON        // Internal External Switchover bit (Internal/External Switchover mode is enabled)
#pragma config FCMEN = ON       // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is enabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)
// CONFIG2
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)
// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.
#include <xc.h>
#define _XTAL_FREQ 4000000
int count=0;
void enable(){
    RE2 = 1;
    __delay_ms(10);
    RE2 = 0;
    __delay_ms(10);
}
void lcd(int rs,int value){
    RE0 = rs;
    PORTD = value;
    enable();
}
void str(char *ptr){
    while(*ptr != '\0'){
        lcd(1,*ptr++);
    }}
void tmr(){
    if(TMR1IF == 1) {
        count++;
        TMR1IF = 0;
    }
    if (count < 10){
        RA0 = 1; RA1=0; RA2=0;
        lcd(0,0x80);
        str("STOP!");
        
    }
    if ((count >= 10) && (count <16)){
        RA1 = 1; RA0=0; RA2=0;
        lcd(0,0x80);
        str("GET READY!");
    }
    if((count >= 16) && (count <26))
    {
        RA2 = 1; RA0=0; RA1=0;
        lcd(0,0x80);
        str("GO!");

    }
    if(count > 26){
        count = 0;
    }
}
void main() {
    PORTA = 0x00;
    TRISA = 0x00;
    TRISD = 0x00;
    PORTD = 0x00;
    TRISE = 0x00;
    PORTE = 0x00;
    ANSEL = 0x00;
    ANSELH = 0x00;
    T1CON = 0x31;
    TMR1 = 3036;

    lcd(0,0x38);
    lcd(0,0x0E);
    lcd(0,0x80);

    while(1){
        tmr();
    }
}